In [1]:
import numpy as np
import pandas as pd

<h2>Finding Missing Data</h2>

In [13]:
data = {
    'A': [1, 2, np.nan, 4, 5],
    'B': [1, 2, 3, 4, 5],
    'C': [1, 2, 3, np.nan, np.nan],
    'D': [1, np.nan, np.nan, np.nan, 5]
}
df = pd.DataFrame(data)
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [14]:
df.isna()

       A      B      C      D
0  False  False  False  False
1  False  False  False   True
2   True  False  False   True
3  False  False   True   True
4  False  False   True  False

<h4>Formula to find missing values</h4>

In [15]:
df.isna().sum()

A    1
B    0
C    2
D    3
dtype: int64

In [16]:
df.isna().any()

A     True
B    False
C     True
D     True
dtype: bool

<h2>Removing Missing Data</h2>

In [17]:
df.dropna()

     A  B    C    D
0  1.0  1  1.0  1.0

In [18]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [20]:
df.dropna(thresh=3)  # thresh =3 means it is mandate to have 3 non null values in all rows

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
4  5.0  5  NaN  5.0

<h2>Filling the missing data</h2>

In [21]:
df   # these are not appllied untill we write inplace = true

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [22]:
df.fillna(0)  # it will fill all null values with 0

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  0.0
2  0.0  3  3.0  0.0
3  4.0  4  0.0  0.0
4  5.0  5  0.0  5.0

<h4>If we want to fill diffrent values at diffrent places of null values</h4>

In [24]:
values = {'A':0, 'B':100, 'C':300, 'D':40}
df.fillna(value=values)

     A  B      C     D
0  1.0  1    1.0   1.0
1  2.0  2    2.0  40.0
2  0.0  3    3.0  40.0
3  4.0  4  300.0  40.0
4  5.0  5  300.0   5.0

<h3> ### In dropna - selection is row-wise and In fillna selection is Column-wise</h3>

<h4> Fill null values with mean</h4>

In [25]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [26]:
df.fillna(df.mean())

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  3.0
2  3.0  3  3.0  3.0
3  4.0  4  2.0  3.0
4  5.0  5  2.0  5.0